maithithusbcolai3778-hub/glasses/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_IDF_SLAVE_TARGET="esp32c6"

# CONFIG_SLAVE_IDF_TARGET_ESP32H2 is not set
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32H2 is not set

CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Enable onboard speaker for /play endpoint
CONFIG_AUDIO_SPEAKER_ENABLE=y

# Enable onboard SD card slot
CONFIG_SD_CARD_ENABLE=n

# Camera preview resolution (smooth 800x480)
CONFIG_CAM_H_RES=800
CONFIG_CAM_V_RES=480

# Sensor source: 800x640 mode, CPU crops to 800x480 (keep bottom for ground obstacles)
CONFIG_CAM_SRC_H_RES=800
CONFIG_CAM_SRC_V_RES=640
# CONFIG_CAM_CROP_ANCHOR_BOTTOM is not set
CONFIG_CAM_CROP_ANCHOR_CENTER=y

CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X640_50FPS=y
# Use larger app partition (2MB) to fit camera + audio + IMU + Wi-Fi stack
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
